var timeOutApp = angular.module('timeOutApp', ['ngMeta']);
timeOutApp.controller('mainController', function ($scope) {
    $scope.totalScore = 0;
    $scope.questions = [
        'מישהו צעק לי ברחוב "למה את לא מחייכת"',
        'גבר זר העיר לי על המראה שלי',
        'גבר שלח לי תמונה של איבר המין שלו',
        'מכונית נסעה לצדי לאט והנוסעים העירו לי הערות מיניות',
        'נגעו בי בניגוד לרצוני',
        'הבוס הציע לי הצעה מגונה',
        'במהלך סקס גבר דחף את הראש שלי למפשעה שלו',
        'גבר ברחוב בחן את הגוף שלי',
        'הבוס שלי התנה את התקדמותי במגע מיני',
        'גבר שסירבתי לשכב איתו המשיך להפעיל עליי לחץ שנשכב',
        'מישהו הכניס לי סם אונס למשקה',
        'גבר זר נצמד אליי באוטובוס',
        'גבר חשף בפניי את איבר המין שלו בניגוד לרצוני',
        'מישהו בעבודה דיבר באופן מיני על מישהי אחרת בנוכחותי',
        "המסאז׳יסט הצמיד אליי את איבר המין שלו",
        'הבוס נגע בי',
        'המרצה שלי העיר על מה שאני לובשת',
        'נהג המונית הציע לשכב איתי תמורת כסף',
        'מישהו שכב איתי כשהייתי שיכורה מאוד',
        'גבר זר ברחוב ניסה לנשק אותי',
        'מכר שלי הראה לי תמונות עירום של מישהי',
        'גבר שאינו קרוב אליי ליטף את שערי ',
        'גבר שיצאתי איתו המשיך לשלוח ידיים אף שביקשתי שיפסיק',
        'גבר זר המשיך להתחיל איתי בבר אף שאמרתי לו שאיני מעוניינת',
        'הבוס שלי הציע שנצא לדייט',
        'מישהו בעבודה לא הפסיק לבהות בחזה שלי',
        'גבר זר שאל אותי אם אני מחפשת זין',
        'גבר שישב מולי באוטובוס נגע בעצמו',
        'קיבלתי הודעה גסה ממישהו בפייסבוק',
        'הבוס העיר על המראה שלי',
        'מישהו בעבודה שאל אם אני עצבנית כי אני במחזור',
        'המרצה שלי העיר הערה מינית במהלך שיעור',
        'לקוח במסעדה שבה אני עובדת ליטף לי את הגב',
        'מישהו התקרב אליי יותר מדי וחדר למרחב האישי שלי'
    ];
    $scope.data = [];
    for (var i = 0; i < $scope.questions.length; i++) {
        var question = $scope.questions[i];
        var questionObj = {
            idx: i,
            question: question,
            checked: false
        };
        $scope.data.push(questionObj);
    }

    $scope.dataByRow = [];
    var currentRow = [];
    for (i = 0; i < $scope.data.length; i++) {
        if (i > 0 && i % $scope.ITEMS_IN_COLUMN === 0) {
            $scope.dataByRow.push(currentRow);
            currentRow = [];
        }
        currentRow.push($scope.data[i]);
    }
    $scope.dataByRow.push(currentRow);

    $scope.checkItem = function (i) {
        $scope.totalScore += $scope.data[i].checked ? 1 : -1;
    }

});